Revit 2027 API
PlumbingUtils Class
 General utility methods in the Autodesk Revit MEP product.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Plumbing.PlumbingUtils
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PlumbingUtils
Public NotInheritable Class PlumbingUtils
public ref class PlumbingUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PlumbingUtils = class end
The PlumbingUtils type exposes the following members.
Methods
Name | Description
BreakCurve |  Breaks the pipe curve into two parts at the given position.
ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId) |  Connects placeholders that looks like Cross connection.
ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId, ElementId) |  Connects placeholders that looks like Cross connection.
ConnectPipePlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) |  Connects placeholders that looks like Cross connection.
ConnectPipePlaceholdersAtElbow(Document, Connector, Connector) |  Connects placeholders that looks like elbow connection.
ConnectPipePlaceholdersAtElbow(Document, ElementId, ElementId) |  Connects placeholders that looks like elbow connection.
ConnectPipePlaceholdersAtTee(Document, ElementId, ElementId) |  Connects two placeholders that looks like Tee connection.
ConnectPipePlaceholdersAtTee(Document, Connector, Connector, Connector) |  Connects three placeholders that looks like Tee connection.
ConvertPipePlaceholders |  Converts a collection of pipe placeholder elements into pipe elements.
HasOpenConnector |  Checks if there is open piping connector for the given element - object of pipe curve, pipe fitting or pipe accessory.
PlaceCapOnOpenEnds |  Places caps on the open connectors of the pipe curve, pipe fitting or pipe accessory.
Top
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace